In [2]:
import numpy as np
import pandas as pd

In [3]:
from numpy.random import randn
np.random.seed(100)

In [4]:
df = pd.DataFrame(randn(5,4),index='A B C D E'.split(),columns='W X Y Z'.split())

In [5]:
df

          W         X         Y         Z
A -1.749765  0.342680  1.153036 -0.252436
B  0.981321  0.514219  0.221180 -1.070043
C -0.189496  0.255001 -0.458027  0.435163
D -0.583595  0.816847  0.672721 -0.104411
E -0.531280  1.029733 -0.438136 -1.118318

In [6]:
df['W']

A   -1.749765
B    0.981321
C   -0.189496
D   -0.583595
E   -0.531280
Name: W, dtype: float64

In [7]:
#Pass list of column names
df[['W','Z']]

          W         Z
A -1.749765 -0.252436
B  0.981321 -1.070043
C -0.189496  0.435163
D -0.583595 -0.104411
E -0.531280 -1.118318

In [8]:
#Sql Syntax (Not Recommended)
df.W

A   -1.749765
B    0.981321
C   -0.189496
D   -0.583595
E   -0.531280
Name: W, dtype: float64

In [9]:
#DataFrame Columns are just series
type(df['W'])

pandas.core.series.Series

In [10]:
df['new'] = df['X'] + df['Y']

In [11]:
df

          W         X         Y         Z       new
A -1.749765  0.342680  1.153036 -0.252436  1.495716
B  0.981321  0.514219  0.221180 -1.070043  0.735399
C -0.189496  0.255001 -0.458027  0.435163 -0.203026
D -0.583595  0.816847  0.672721 -0.104411  1.489568
E -0.531280  1.029733 -0.438136 -1.118318  0.591597

In [12]:
df.drop('new',axis=1)

          W         X         Y         Z
A -1.749765  0.342680  1.153036 -0.252436
B  0.981321  0.514219  0.221180 -1.070043
C -0.189496  0.255001 -0.458027  0.435163
D -0.583595  0.816847  0.672721 -0.104411
E -0.531280  1.029733 -0.438136 -1.118318

In [13]:
#Not Inplace unless specified
df

          W         X         Y         Z       new
A -1.749765  0.342680  1.153036 -0.252436  1.495716
B  0.981321  0.514219  0.221180 -1.070043  0.735399
C -0.189496  0.255001 -0.458027  0.435163 -0.203026
D -0.583595  0.816847  0.672721 -0.104411  1.489568
E -0.531280  1.029733 -0.438136 -1.118318  0.591597

In [14]:
df.drop('new',axis=1,inplace=True)

In [15]:
df

          W         X         Y         Z
A -1.749765  0.342680  1.153036 -0.252436
B  0.981321  0.514219  0.221180 -1.070043
C -0.189496  0.255001 -0.458027  0.435163
D -0.583595  0.816847  0.672721 -0.104411
E -0.531280  1.029733 -0.438136 -1.118318

In [16]:
df.drop('E',axis=0)

          W         X         Y         Z
A -1.749765  0.342680  1.153036 -0.252436
B  0.981321  0.514219  0.221180 -1.070043
C -0.189496  0.255001 -0.458027  0.435163
D -0.583595  0.816847  0.672721 -0.104411

In [17]:
#Selecting Rows
df.loc['A']

W   -1.749765
X    0.342680
Y    1.153036
Z   -0.252436
Name: A, dtype: float64

In [18]:
df.iloc[3]

W   -0.583595
X    0.816847
Y    0.672721
Z   -0.104411
Name: D, dtype: float64

In [19]:
#Slecting subset of rows and columns
df.loc['A','X']

np.float64(0.34268040332750216)

In [20]:
df.loc[['A','B'],['X','Y']]

          X         Y
A  0.342680  1.153036
B  0.514219  0.221180

### Conditional Selection
*An important feature of pandas is conditional selection using bracket notation, very similar to numpy:*

In [21]:
df

          W         X         Y         Z
A -1.749765  0.342680  1.153036 -0.252436
B  0.981321  0.514219  0.221180 -1.070043
C -0.189496  0.255001 -0.458027  0.435163
D -0.583595  0.816847  0.672721 -0.104411
E -0.531280  1.029733 -0.438136 -1.118318

In [22]:
df > 0

       W     X      Y      Z
A  False  True   True  False
B   True  True   True  False
C  False  True  False   True
D  False  True   True  False
E  False  True  False  False

In [23]:
df[df>0]

          W         X         Y         Z
A       NaN  0.342680  1.153036       NaN
B  0.981321  0.514219  0.221180       NaN
C       NaN  0.255001       NaN  0.435163
D       NaN  0.816847  0.672721       NaN
E       NaN  1.029733       NaN       NaN

In [25]:
df[df['W']>0]

          W         X        Y         Z
B  0.981321  0.514219  0.22118 -1.070043

In [27]:
df[df['W']>0]['Y']

B    0.22118
Name: Y, dtype: float64

In [29]:
df[df['W']>0][['Y','X']]

         Y         X
B  0.22118  0.514219

In [36]:
df[(df['W']>0) & (df['Y']>0.2)]

          W         X        Y         Z
B  0.981321  0.514219  0.22118 -1.070043

### More Index Details
*Let's discuss some more features of indexing, including resetting the index or setting it something else. We'll also talk about index hierarchy!*

In [37]:
df

          W         X         Y         Z
A -1.749765  0.342680  1.153036 -0.252436
B  0.981321  0.514219  0.221180 -1.070043
C -0.189496  0.255001 -0.458027  0.435163
D -0.583595  0.816847  0.672721 -0.104411
E -0.531280  1.029733 -0.438136 -1.118318

In [38]:
df.reset_index()

  index         W         X         Y         Z
0     A -1.749765  0.342680  1.153036 -0.252436
1     B  0.981321  0.514219  0.221180 -1.070043
2     C -0.189496  0.255001 -0.458027  0.435163
3     D -0.583595  0.816847  0.672721 -0.104411
4     E -0.531280  1.029733 -0.438136 -1.118318

In [39]:
newind = 'CA NY WY OR CO'.split()

In [40]:
df['States'] = newind

In [41]:
df

          W         X         Y         Z States
A -1.749765  0.342680  1.153036 -0.252436     CA
B  0.981321  0.514219  0.221180 -1.070043     NY
C -0.189496  0.255001 -0.458027  0.435163     WY
D -0.583595  0.816847  0.672721 -0.104411     OR
E -0.531280  1.029733 -0.438136 -1.118318     CO

In [42]:
df.set_index('States')

               W         X         Y         Z
States
CA     -1.749765  0.342680  1.153036 -0.252436
NY      0.981321  0.514219  0.221180 -1.070043
WY     -0.189496  0.255001 -0.458027  0.435163
OR     -0.583595  0.816847  0.672721 -0.104411
CO     -0.531280  1.029733 -0.438136 -1.118318

In [43]:
df

          W         X         Y         Z States
A -1.749765  0.342680  1.153036 -0.252436     CA
B  0.981321  0.514219  0.221180 -1.070043     NY
C -0.189496  0.255001 -0.458027  0.435163     WY
D -0.583595  0.816847  0.672721 -0.104411     OR
E -0.531280  1.029733 -0.438136 -1.118318     CO

In [44]:
df.set_index('States',inplace=True)

In [45]:
df

               W         X         Y         Z
States
CA     -1.749765  0.342680  1.153036 -0.252436
NY      0.981321  0.514219  0.221180 -1.070043
WY     -0.189496  0.255001 -0.458027  0.435163
OR     -0.583595  0.816847  0.672721 -0.104411
CO     -0.531280  1.029733 -0.438136 -1.118318

## Multi-Index and Index Hierarchy

Let us go over how to work with Multi-Index, first we'll create a quick example of what a Multi-Indexed DataFrame would look like:

In [46]:
# Index Levels
outside = ['G1','G1','G1','G2','G2','G2']
inside = [1,2,3,1,2,3]
hier_index = list(zip(outside,inside))
hier_index = pd.MultiIndex.from_tuples(hier_index)

In [47]:
hier_index

MultiIndex([('G1', 1),
            ('G1', 2),
            ('G1', 3),
            ('G2', 1),
            ('G2', 2),
            ('G2', 3)],
           )

In [48]:
df = pd.DataFrame(np.random.randn(6,2),index=hier_index,columns=['A','B'])
df

             A         B
G1 1  1.618982  1.541605
   2 -0.251879 -0.842436
   3  0.184519  0.937082
G2 1  0.731000  1.361556
   2 -0.326238  0.055676
   3  0.222400 -1.443217

In [49]:
df.loc['G1']

          A         B
1  1.618982  1.541605
2 -0.251879 -0.842436
3  0.184519  0.937082

In [50]:
df.loc['G1'].loc[1]

A    1.618982
B    1.541605
Name: 1, dtype: float64

In [51]:
df.index.names

FrozenList([None, None])

In [52]:
df.index.names = ['Group','Num']

In [53]:
df

                  A         B
Group Num
G1    1    1.618982  1.541605
      2   -0.251879 -0.842436
      3    0.184519  0.937082
G2    1    0.731000  1.361556
      2   -0.326238  0.055676
      3    0.222400 -1.443217

In [54]:
df.xs('G1')

            A         B
Num
1    1.618982  1.541605
2   -0.251879 -0.842436
3    0.184519  0.937082

In [55]:
df.xs(1,level='Num')

              A         B
Group
G1     1.618982  1.541605
G2     0.731000  1.361556